spec/vcr_cassettes/BeyondApi_Checkout_Cart/with_cart/_assign_shipping_method_to_default/sets_the_cart_shipping_method_to_the_current_default_shipping_method.yml

---
http_interactions:
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/oauth/token?grant_type=client_credentials
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Basic <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2024 20:07:23 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Cache-Control:
      - no-store
      Pragma:
      - no-cache
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.102'
      X-B3-Traceid:
      - 34c8f2353316c212674f06be0c44a72a
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "access_token" : "<ACCESS_TOKEN>",
          "token_type" : "bearer",
          "expires_in" : 3599,
          "scope" : "orde:r prat:dcur pypr:cur prod:urdc lcnt:u pymt:ur loca:urcd sctg:m shat:cdru rfpr:ur prad:rcd shpz:dcur shad:u ordr:cur shop:u shim:cd cust:urcd clpr:cr legl:ur prda:ru rtpr:rc oset:ur shpr:rcu cset:ru ordp:r catg:cdur nltg:m",
          "tenantId" : 8542,
          "iat" : 1727813243,
          "jti" : "XgcBJcZIj3i8XsnbhpizCfxtkL4="
        }
  recorded_at: Tue, 01 Oct 2024 20:07:23 GMT
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 01 Oct 2024 20:07:24 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Location:
      - https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.081'
      X-B3-Traceid:
      - fd79b030573545428a7d4798b94450f7
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "_id" : "46a79192-24c9-496c-bca0-1ded8375fb2f",
          "lineItems" : [ ],
          "shippingLineItem" : null,
          "pickupLineItem" : null,
          "paymentLineItem" : {
            "lineItemPrice" : {
              "taxModel" : "GROSS",
              "currency" : "GBP",
              "amount" : 0
            },
            "lineItemTaxes" : [ ],
            "_embedded" : {
              "payment-method" : {
                "_id" : "c5cdf11e-6947-471e-a76a-1534a6ff5809",
                "name" : "Invoice",
                "description" : null,
                "officialName" : "Invoice",
                "officialDescription" : "You issue an invoice. After receipt of the goods, the customer transfers the payment.",
                "defaultPaymentNote" : null,
                "taxClass" : "REGULAR",
                "discountOrFee" : {
                  "type" : "ABSOLUTE",
                  "absoluteValue" : {
                    "taxModel" : "GROSS",
                    "currency" : "GBP",
                    "amount" : 0
                  },
                  "percentageValue" : null
                },
                "position" : 1,
                "minimumOrderValue" : null,
                "activated" : true,
                "activeLogoSet" : null,
                "onlinePayment" : false,
                "workflow" : null,
                "_links" : {
                  "self" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "deactivate-payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809/deactivate"
                  }
                }
              }
            }
          },
          "couponLineItem" : null,
          "billingAddress" : null,
          "shippingAddress" : null,
          "subtotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "grandTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "netTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxes" : [ ],
          "taxable" : true,
          "minimumOrderValue" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "mustAcceptTermsAndConditions" : false,
          "mustEnterPhoneNumber" : false,
          "weight" : 0,
          "checkoutState" : {
            "shippingMethodValid" : false,
            "shippingMethodSelectable" : false,
            "pickupOptionValid" : false,
            "paymentMethodValid" : true,
            "paymentMethodSelectable" : true,
            "billingAddressSet" : false,
            "priceValidToOrder" : true,
            "paymentTransactionStatus" : "NO_APPROVAL_NEEDED",
            "readyToOrder" : false
          },
          "customerEmail" : null,
          "_links" : {
            "self" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f"
            },
            "line-items" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/line-items"
            },
            "payment-method-available" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/payment-methods"
            },
            "payment-method-default" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/payment-methods/default"
            },
            "payment-method-current" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/payment-methods/current"
            },
            "billing-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/billing-address"
            },
            "shipping-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts"
            }
          }
        }
  recorded_at: Tue, 01 Oct 2024 20:07:24 GMT
- request:
    method: put
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/payment-methods/default
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2024 20:07:24 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.100'
      X-B3-Traceid:
      - 1bace450daac807d8a450d0941d555e4
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "_id" : "46a79192-24c9-496c-bca0-1ded8375fb2f",
          "lineItems" : [ ],
          "shippingLineItem" : null,
          "pickupLineItem" : null,
          "paymentLineItem" : {
            "lineItemPrice" : {
              "taxModel" : "GROSS",
              "currency" : "GBP",
              "amount" : 0
            },
            "lineItemTaxes" : [ ],
            "_embedded" : {
              "payment-method" : {
                "_id" : "c5cdf11e-6947-471e-a76a-1534a6ff5809",
                "name" : "Invoice",
                "description" : null,
                "officialName" : "Invoice",
                "officialDescription" : "You issue an invoice. After receipt of the goods, the customer transfers the payment.",
                "defaultPaymentNote" : null,
                "taxClass" : "REGULAR",
                "discountOrFee" : {
                  "type" : "ABSOLUTE",
                  "absoluteValue" : {
                    "taxModel" : "GROSS",
                    "currency" : "GBP",
                    "amount" : 0
                  },
                  "percentageValue" : null
                },
                "position" : 1,
                "minimumOrderValue" : null,
                "activated" : true,
                "activeLogoSet" : null,
                "onlinePayment" : false,
                "workflow" : null,
                "_links" : {
                  "self" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "deactivate-payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809/deactivate"
                  }
                }
              }
            }
          },
          "couponLineItem" : null,
          "billingAddress" : null,
          "shippingAddress" : null,
          "subtotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "grandTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "netTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxes" : [ ],
          "taxable" : true,
          "minimumOrderValue" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "mustAcceptTermsAndConditions" : false,
          "mustEnterPhoneNumber" : false,
          "weight" : 0,
          "checkoutState" : {
            "shippingMethodValid" : false,
            "shippingMethodSelectable" : false,
            "pickupOptionValid" : false,
            "paymentMethodValid" : true,
            "paymentMethodSelectable" : true,
            "billingAddressSet" : false,
            "priceValidToOrder" : true,
            "paymentTransactionStatus" : "NO_APPROVAL_NEEDED",
            "readyToOrder" : false
          },
          "customerEmail" : null,
          "_links" : {
            "self" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f"
            },
            "line-items" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/line-items"
            },
            "payment-method-available" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/payment-methods"
            },
            "payment-method-default" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/payment-methods/default"
            },
            "payment-method-current" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/payment-methods/current"
            },
            "billing-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f/billing-address"
            },
            "shipping-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts"
            }
          }
        }
  recorded_at: Tue, 01 Oct 2024 20:07:24 GMT
- request:
    method: delete
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/46a79192-24c9-496c-bca0-1ded8375fb2f
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 204
      message: No Content
    headers:
      Date:
      - Tue, 01 Oct 2024 20:07:24 GMT
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.047'
      X-B3-Traceid:
      - 1586d3dbb40c1f5152a90aac1729715a
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: ''
  recorded_at: Tue, 01 Oct 2024 20:07:24 GMT
recorded_with: VCR 6.2.0
