spec/vcr_cassettes/BeyondApi_Checkout_Cart/with_cart/_billing_address/sets_the_billing_address_of_the_cart.yml

---
http_interactions:
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/oauth/token?grant_type=client_credentials
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Basic <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:16 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Cache-Control:
      - no-store
      Pragma:
      - no-cache
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.101'
      X-B3-Traceid:
      - 85ec9b1cce9397312009dd3f126b3fc4
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "access_token" : "<ACCESS_TOKEN>",
          "token_type" : "bearer",
          "expires_in" : 3599,
          "scope" : "orde:r prat:dcur pypr:cur prod:urdc lcnt:u pymt:ur loca:urcd sctg:m shat:cdru rfpr:ur prad:rcd shpz:dcur shad:u ordr:cur shop:u shim:cd cust:urcd clpr:cr legl:ur prda:ru rtpr:rc oset:ur shpr:rcu cset:ru ordp:r catg:cdur nltg:m",
          "tenantId" : 8542,
          "iat" : 1727812996,
          "jti" : "5w3jsqpuSH4YCd4UHatsR438nSg="
        }
  recorded_at: Tue, 01 Oct 2024 20:03:16 GMT
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:16 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Location:
      - https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.089'
      X-B3-Traceid:
      - b6b8d86a53da625352b25d2983e41f21
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "_id" : "8aa01a0c-ebda-4124-bbee-cd7ca377dcbf",
          "lineItems" : [ ],
          "shippingLineItem" : null,
          "pickupLineItem" : null,
          "paymentLineItem" : {
            "lineItemPrice" : {
              "taxModel" : "GROSS",
              "currency" : "GBP",
              "amount" : 0
            },
            "lineItemTaxes" : [ ],
            "_embedded" : {
              "payment-method" : {
                "_id" : "c5cdf11e-6947-471e-a76a-1534a6ff5809",
                "name" : "Invoice",
                "description" : null,
                "officialName" : "Invoice",
                "officialDescription" : "You issue an invoice. After receipt of the goods, the customer transfers the payment.",
                "defaultPaymentNote" : null,
                "taxClass" : "REGULAR",
                "discountOrFee" : {
                  "type" : "ABSOLUTE",
                  "absoluteValue" : {
                    "taxModel" : "GROSS",
                    "currency" : "GBP",
                    "amount" : 0
                  },
                  "percentageValue" : null
                },
                "position" : 1,
                "minimumOrderValue" : null,
                "activated" : true,
                "activeLogoSet" : null,
                "onlinePayment" : false,
                "workflow" : null,
                "_links" : {
                  "self" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "deactivate-payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809/deactivate"
                  }
                }
              }
            }
          },
          "couponLineItem" : null,
          "billingAddress" : null,
          "shippingAddress" : null,
          "subtotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "grandTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "netTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxes" : [ ],
          "taxable" : true,
          "minimumOrderValue" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "mustAcceptTermsAndConditions" : false,
          "mustEnterPhoneNumber" : false,
          "weight" : 0,
          "checkoutState" : {
            "shippingMethodValid" : false,
            "shippingMethodSelectable" : false,
            "pickupOptionValid" : false,
            "paymentMethodValid" : true,
            "paymentMethodSelectable" : true,
            "billingAddressSet" : false,
            "priceValidToOrder" : true,
            "paymentTransactionStatus" : "NO_APPROVAL_NEEDED",
            "readyToOrder" : false
          },
          "customerEmail" : null,
          "_links" : {
            "self" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf"
            },
            "line-items" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/line-items"
            },
            "payment-method-available" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/payment-methods"
            },
            "payment-method-default" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/payment-methods/default"
            },
            "payment-method-current" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/payment-methods/current"
            },
            "billing-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/billing-address"
            },
            "shipping-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts"
            }
          }
        }
  recorded_at: Tue, 01 Oct 2024 20:03:16 GMT
- request:
    method: put
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/billing-address
    body:
      encoding: UTF-8
      string: '{"salutation":"Mrs","gender":"FEMALE","title":"Dr","firstName":"Astrid","middleName":"Agnes","lastName":"Alster","street":"Alsterwasserweg","houseNumber":"2","street2":"Erdgeschoss","doorCode":"0185","addressExtension":"Hinterhof","postalCode":"20999","dependentLocality":"Seevetal","city":"Alsterwasser","country":"DE","state":"Hamburg","email":"a.alsterh@example.com","phone":"(800)
        555-0102","mobile":"(800) 555-0103","vatId":"123456789","taxNumber":"123-34-6789","birthDate":"1985-03-20"}'
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:16 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.111'
      X-B3-Traceid:
      - 87f3d7afbac7397832ba815d3ecdc7e4
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "_id" : "8aa01a0c-ebda-4124-bbee-cd7ca377dcbf",
          "lineItems" : [ ],
          "shippingLineItem" : null,
          "pickupLineItem" : null,
          "paymentLineItem" : {
            "lineItemPrice" : {
              "taxModel" : "GROSS",
              "currency" : "GBP",
              "amount" : 0
            },
            "lineItemTaxes" : [ ],
            "_embedded" : {
              "payment-method" : {
                "_id" : "c5cdf11e-6947-471e-a76a-1534a6ff5809",
                "name" : "Invoice",
                "description" : null,
                "officialName" : "Invoice",
                "officialDescription" : "You issue an invoice. After receipt of the goods, the customer transfers the payment.",
                "defaultPaymentNote" : null,
                "taxClass" : "REGULAR",
                "discountOrFee" : {
                  "type" : "ABSOLUTE",
                  "absoluteValue" : {
                    "taxModel" : "GROSS",
                    "currency" : "GBP",
                    "amount" : 0
                  },
                  "percentageValue" : null
                },
                "position" : 1,
                "minimumOrderValue" : null,
                "activated" : true,
                "activeLogoSet" : null,
                "onlinePayment" : false,
                "workflow" : null,
                "_links" : {
                  "self" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "deactivate-payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809/deactivate"
                  }
                }
              }
            }
          },
          "couponLineItem" : null,
          "billingAddress" : {
            "salutation" : "Mrs",
            "gender" : "FEMALE",
            "company" : null,
            "title" : "Dr",
            "firstName" : "Astrid",
            "middleName" : "Agnes",
            "lastName" : "Alster",
            "street" : "Alsterwasserweg",
            "houseNumber" : "2",
            "street2" : "Erdgeschoss",
            "addressExtension" : "Hinterhof",
            "postalCode" : "20999",
            "dependentLocality" : "Seevetal",
            "city" : "Alsterwasser",
            "country" : "DE",
            "state" : "Hamburg",
            "email" : "a.alsterh@example.com",
            "phone" : "(800) 555-0102",
            "mobile" : "(800) 555-0103",
            "displayAddressLines" : [ "Astrid Agnes Alster", "Seevetal", "Alsterwasserweg 2", "Erdgeschoss", "Hinterhof", "20999 Alsterwasser", "GERMANY" ],
            "vatId" : "123456789",
            "taxNumber" : "123-34-6789",
            "birthDate" : "1985-03-20"
          },
          "shippingAddress" : null,
          "subtotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "grandTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "netTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxes" : [ ],
          "taxable" : false,
          "minimumOrderValue" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "mustAcceptTermsAndConditions" : false,
          "mustEnterPhoneNumber" : false,
          "weight" : 0,
          "checkoutState" : {
            "shippingMethodValid" : false,
            "shippingMethodSelectable" : false,
            "pickupOptionValid" : false,
            "paymentMethodValid" : true,
            "paymentMethodSelectable" : true,
            "billingAddressSet" : true,
            "priceValidToOrder" : true,
            "paymentTransactionStatus" : "NO_APPROVAL_NEEDED",
            "readyToOrder" : false
          },
          "customerEmail" : null,
          "_links" : {
            "self" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf"
            },
            "line-items" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/line-items"
            },
            "payment-method-available" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/payment-methods"
            },
            "payment-method-default" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/payment-methods/default"
            },
            "payment-method-current" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/payment-methods/current"
            },
            "billing-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf/billing-address"
            },
            "shipping-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts"
            }
          }
        }
  recorded_at: Tue, 01 Oct 2024 20:03:16 GMT
- request:
    method: delete
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/8aa01a0c-ebda-4124-bbee-cd7ca377dcbf
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 204
      message: No Content
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:16 GMT
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.044'
      X-B3-Traceid:
      - 44c95c385c6d21cb283b03380f7d75d8
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: ''
  recorded_at: Tue, 01 Oct 2024 20:03:16 GMT
recorded_with: VCR 6.2.0
