spec/vcr_cassettes/BeyondApi_Checkout_Cart/with_cart/_create_payment_and_order/initiates_the_creation_of_a_payment_and_order_for_the_cart.yml

---
http_interactions:
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/oauth/token?grant_type=client_credentials
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Basic <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2024 20:06:19 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Cache-Control:
      - no-store
      Pragma:
      - no-cache
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.099'
      X-B3-Traceid:
      - f36ce2bf2a71478f2de2889dcce45830
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "access_token" : "<ACCESS_TOKEN>",
          "token_type" : "bearer",
          "expires_in" : 3599,
          "scope" : "orde:r prat:dcur pypr:cur prod:urdc lcnt:u pymt:ur loca:urcd sctg:m shat:cdru rfpr:ur prad:rcd shpz:dcur shad:u ordr:cur shop:u shim:cd cust:urcd clpr:cr legl:ur prda:ru rtpr:rc oset:ur shpr:rcu cset:ru ordp:r catg:cdur nltg:m",
          "tenantId" : 8542,
          "iat" : 1727813179,
          "jti" : "r8ZL54Cu4EmXWQDpeCymzQZ/geQ="
        }
  recorded_at: Tue, 01 Oct 2024 20:06:19 GMT
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 01 Oct 2024 20:06:19 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Location:
      - https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.122'
      X-B3-Traceid:
      - '08d77776ca281acbf9d51e8b77ae826b'
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "_id" : "350f2378-11dd-4635-a1c0-0cfcb8fc128d",
          "lineItems" : [ ],
          "shippingLineItem" : null,
          "pickupLineItem" : null,
          "paymentLineItem" : {
            "lineItemPrice" : {
              "taxModel" : "GROSS",
              "currency" : "GBP",
              "amount" : 0
            },
            "lineItemTaxes" : [ ],
            "_embedded" : {
              "payment-method" : {
                "_id" : "c5cdf11e-6947-471e-a76a-1534a6ff5809",
                "name" : "Invoice",
                "description" : null,
                "officialName" : "Invoice",
                "officialDescription" : "You issue an invoice. After receipt of the goods, the customer transfers the payment.",
                "defaultPaymentNote" : null,
                "taxClass" : "REGULAR",
                "discountOrFee" : {
                  "type" : "ABSOLUTE",
                  "absoluteValue" : {
                    "taxModel" : "GROSS",
                    "currency" : "GBP",
                    "amount" : 0
                  },
                  "percentageValue" : null
                },
                "position" : 1,
                "minimumOrderValue" : null,
                "activated" : true,
                "activeLogoSet" : null,
                "onlinePayment" : false,
                "workflow" : null,
                "_links" : {
                  "self" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "deactivate-payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809/deactivate"
                  }
                }
              }
            }
          },
          "couponLineItem" : null,
          "billingAddress" : null,
          "shippingAddress" : null,
          "subtotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "grandTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "netTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxes" : [ ],
          "taxable" : true,
          "minimumOrderValue" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "mustAcceptTermsAndConditions" : false,
          "mustEnterPhoneNumber" : false,
          "weight" : 0,
          "checkoutState" : {
            "shippingMethodValid" : false,
            "shippingMethodSelectable" : false,
            "pickupOptionValid" : false,
            "paymentMethodValid" : true,
            "paymentMethodSelectable" : true,
            "billingAddressSet" : false,
            "priceValidToOrder" : true,
            "paymentTransactionStatus" : "NO_APPROVAL_NEEDED",
            "readyToOrder" : false
          },
          "customerEmail" : null,
          "_links" : {
            "self" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d"
            },
            "line-items" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d/line-items"
            },
            "payment-method-available" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d/payment-methods"
            },
            "payment-method-default" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d/payment-methods/default"
            },
            "payment-method-current" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d/payment-methods/current"
            },
            "billing-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d/billing-address"
            },
            "shipping-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts"
            }
          }
        }
  recorded_at: Tue, 01 Oct 2024 20:06:19 GMT
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d/create-payment
    body:
      encoding: UTF-8
      string: '{"returnUri":"https://example.com/return","cancelUri":"https://example.com/cancel","customerComment":"Please
        send with UPS.","salesChannel":"Storefront","marketingChannel":"Google Shopping","marketingSubchannel":"Summer
        Sale","testOrder":false,"termsAndConditionsExplicitlyAccepted":true}'
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Date:
      - Tue, 01 Oct 2024 20:06:19 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.035'
      X-B3-Traceid:
      - ea06e638dfe86ffa059a7622edc6d0ec
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "errorId" : "payment-method-error",
          "details" : { },
          "message" : "There is no payment method definition associated with this payment method!",
          "traceId" : "ea06e638dfe86ffa059a7622edc6d0ec"
        }
  recorded_at: Tue, 01 Oct 2024 20:06:19 GMT
- request:
    method: delete
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/350f2378-11dd-4635-a1c0-0cfcb8fc128d
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 204
      message: No Content
    headers:
      Date:
      - Tue, 01 Oct 2024 20:06:19 GMT
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.038'
      X-B3-Traceid:
      - 80d8efac6e53eacbb4a3e176e40bdb2f
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: ''
  recorded_at: Tue, 01 Oct 2024 20:06:19 GMT
recorded_with: VCR 6.2.0
