spec/vcr_cassettes/BeyondApi_Checkout_Cart/with_cart/_payment_methods/lists_all_applicable_payment_methods_for_the_current_cart.yml

---
http_interactions:
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/oauth/token?grant_type=client_credentials
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Basic <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:29 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Cache-Control:
      - no-store
      Pragma:
      - no-cache
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Strict-Transport-Security:
      - max-age=31536000 ; includeSubDomains
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.135'
      X-B3-Traceid:
      - c591b468bb51ab7f1bb4654191c06e62
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "access_token" : "<ACCESS_TOKEN>",
          "token_type" : "bearer",
          "expires_in" : 3599,
          "scope" : "orde:r prat:dcur pypr:cur prod:urdc lcnt:u pymt:ur loca:urcd sctg:m shat:cdru rfpr:ur prad:rcd shpz:dcur shad:u ordr:cur shop:u shim:cd cust:urcd clpr:cr legl:ur prda:ru rtpr:rc oset:ur shpr:rcu cset:ru ordp:r catg:cdur nltg:m",
          "tenantId" : 8542,
          "iat" : 1727813009,
          "jti" : "gevQXlbEKtF9jbitFeIFrVZNg6Q="
        }
  recorded_at: Tue, 01 Oct 2024 20:03:29 GMT
- request:
    method: post
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:29 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Location:
      - https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.099'
      X-B3-Traceid:
      - 787a4d3629fe4b1ffef8d4a3d0d530a8
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "_id" : "e31fc0ef-0944-4937-baed-090fda110441",
          "lineItems" : [ ],
          "shippingLineItem" : null,
          "pickupLineItem" : null,
          "paymentLineItem" : {
            "lineItemPrice" : {
              "taxModel" : "GROSS",
              "currency" : "GBP",
              "amount" : 0
            },
            "lineItemTaxes" : [ ],
            "_embedded" : {
              "payment-method" : {
                "_id" : "c5cdf11e-6947-471e-a76a-1534a6ff5809",
                "name" : "Invoice",
                "description" : null,
                "officialName" : "Invoice",
                "officialDescription" : "You issue an invoice. After receipt of the goods, the customer transfers the payment.",
                "defaultPaymentNote" : null,
                "taxClass" : "REGULAR",
                "discountOrFee" : {
                  "type" : "ABSOLUTE",
                  "absoluteValue" : {
                    "taxModel" : "GROSS",
                    "currency" : "GBP",
                    "amount" : 0
                  },
                  "percentageValue" : null
                },
                "position" : 1,
                "minimumOrderValue" : null,
                "activated" : true,
                "activeLogoSet" : null,
                "onlinePayment" : false,
                "workflow" : null,
                "_links" : {
                  "self" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                  },
                  "deactivate-payment-method" : {
                    "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809/deactivate"
                  }
                }
              }
            }
          },
          "couponLineItem" : null,
          "billingAddress" : null,
          "shippingAddress" : null,
          "subtotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "grandTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "netTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxTotal" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "taxes" : [ ],
          "taxable" : true,
          "minimumOrderValue" : {
            "currency" : "GBP",
            "amount" : 0
          },
          "mustAcceptTermsAndConditions" : false,
          "mustEnterPhoneNumber" : false,
          "weight" : 0,
          "checkoutState" : {
            "shippingMethodValid" : false,
            "shippingMethodSelectable" : false,
            "pickupOptionValid" : false,
            "paymentMethodValid" : true,
            "paymentMethodSelectable" : true,
            "billingAddressSet" : false,
            "priceValidToOrder" : true,
            "paymentTransactionStatus" : "NO_APPROVAL_NEEDED",
            "readyToOrder" : false
          },
          "customerEmail" : null,
          "_links" : {
            "self" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441"
            },
            "line-items" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441/line-items"
            },
            "payment-method-available" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441/payment-methods"
            },
            "payment-method-default" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441/payment-methods/default"
            },
            "payment-method-current" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441/payment-methods/current"
            },
            "billing-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441/billing-address"
            },
            "shipping-address" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts"
            }
          }
        }
  recorded_at: Tue, 01 Oct 2024 20:03:29 GMT
- request:
    method: get
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441/payment-methods
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:29 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.046'
      X-B3-Traceid:
      - 527514d489ad52b9621f748ca687f4a1
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: |-
        {
          "_embedded" : {
            "payment-methods" : [ {
              "lineItemPrice" : {
                "taxModel" : "GROSS",
                "currency" : "GBP",
                "amount" : 0
              },
              "selectable" : true,
              "_embedded" : {
                "payment-method" : {
                  "_id" : "c5cdf11e-6947-471e-a76a-1534a6ff5809",
                  "name" : "Invoice",
                  "description" : null,
                  "officialName" : "Invoice",
                  "officialDescription" : "You issue an invoice. After receipt of the goods, the customer transfers the payment.",
                  "defaultPaymentNote" : null,
                  "taxClass" : "REGULAR",
                  "discountOrFee" : {
                    "type" : "ABSOLUTE",
                    "absoluteValue" : {
                      "taxModel" : "GROSS",
                      "currency" : "GBP",
                      "amount" : 0
                    },
                    "percentageValue" : null
                  },
                  "position" : 1,
                  "minimumOrderValue" : null,
                  "activated" : true,
                  "activeLogoSet" : null,
                  "onlinePayment" : false,
                  "workflow" : null,
                  "_links" : {
                    "self" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                    },
                    "payment-method" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809"
                    },
                    "deactivate-payment-method" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/c5cdf11e-6947-471e-a76a-1534a6ff5809/deactivate"
                    }
                  }
                }
              }
            }, {
              "lineItemPrice" : {
                "taxModel" : "GROSS",
                "currency" : "GBP",
                "amount" : 0
              },
              "selectable" : true,
              "_embedded" : {
                "payment-method" : {
                  "_id" : "147d2711-367f-4344-8637-f4b88418b751",
                  "name" : "Payment in advance",
                  "description" : null,
                  "officialName" : "Payment in advance",
                  "officialDescription" : "You only dispatch the goods upon receipt of the customer payment.",
                  "defaultPaymentNote" : null,
                  "taxClass" : "REGULAR",
                  "discountOrFee" : {
                    "type" : "ABSOLUTE",
                    "absoluteValue" : {
                      "taxModel" : "GROSS",
                      "currency" : "GBP",
                      "amount" : 0
                    },
                    "percentageValue" : null
                  },
                  "position" : 2,
                  "minimumOrderValue" : null,
                  "activated" : true,
                  "activeLogoSet" : null,
                  "onlinePayment" : false,
                  "workflow" : null,
                  "_links" : {
                    "self" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/147d2711-367f-4344-8637-f4b88418b751"
                    },
                    "payment-method" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/147d2711-367f-4344-8637-f4b88418b751"
                    },
                    "deactivate-payment-method" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/147d2711-367f-4344-8637-f4b88418b751/deactivate"
                    }
                  }
                }
              }
            }, {
              "lineItemPrice" : {
                "taxModel" : "GROSS",
                "currency" : "GBP",
                "amount" : 0
              },
              "selectable" : true,
              "_embedded" : {
                "payment-method" : {
                  "_id" : "245bf7d1-507d-442e-b9cb-7c8bca086cdf",
                  "name" : "Cash",
                  "description" : null,
                  "officialName" : "Cash",
                  "officialDescription" : "The customer pays the invoice in cash.",
                  "defaultPaymentNote" : null,
                  "taxClass" : "REGULAR",
                  "discountOrFee" : {
                    "type" : "ABSOLUTE",
                    "absoluteValue" : {
                      "taxModel" : "GROSS",
                      "currency" : "GBP",
                      "amount" : 0
                    },
                    "percentageValue" : null
                  },
                  "position" : 3,
                  "minimumOrderValue" : null,
                  "activated" : true,
                  "activeLogoSet" : null,
                  "onlinePayment" : false,
                  "workflow" : null,
                  "_links" : {
                    "self" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/245bf7d1-507d-442e-b9cb-7c8bca086cdf"
                    },
                    "payment-method" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/245bf7d1-507d-442e-b9cb-7c8bca086cdf"
                    },
                    "deactivate-payment-method" : {
                      "href" : "https://team42-beyond-api.beyondshop.cloud/api/payment-methods/245bf7d1-507d-442e-b9cb-7c8bca086cdf/deactivate"
                    }
                  }
                }
              }
            } ]
          },
          "_links" : {
            "self" : {
              "href" : "https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441/payment-methods"
            }
          }
        }
  recorded_at: Tue, 01 Oct 2024 20:03:29 GMT
- request:
    method: delete
    uri: https://team42-beyond-api.beyondshop.cloud/api/carts/e31fc0ef-0944-4937-baed-090fda110441
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Content-Type:
      - application/json
      User-Agent:
      - Faraday v2.10.1
      Authorization:
      - Bearer <ACCESS_TOKEN>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 204
      message: No Content
    headers:
      Date:
      - Tue, 01 Oct 2024 20:03:29 GMT
      Connection:
      - keep-alive
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Cache-Control:
      - no-cache, no-store, max-age=0, must-revalidate
      Pragma:
      - no-cache
      Expires:
      - '0'
      X-Frame-Options:
      - DENY
      Server:
      - epages-beyond
      X-Request-Time:
      - '0.048'
      X-B3-Traceid:
      - 7f468f3f33a7d86f23e93a30887f80ab
      X-Hello-Human:
      - Come work with us! https://developer.epages.com/devjobs/
    body:
      encoding: UTF-8
      string: ''
  recorded_at: Tue, 01 Oct 2024 20:03:29 GMT
recorded_with: VCR 6.2.0
